blog/2014-03-04-linkfest.html

<!DOCTYPE HTML>
<html>
<head>
	<meta charset="utf-8">
	<title>Linkfest - Everything Counts</title>
	<meta name="author" content="Ronert Obst">

	
	<meta name="description" content="I am going to try and start posting regularily again, including proper
blog posts and not just linkfests. Statistics and Machine Learning A Fervent &hellip;">
	
	<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

	<link href="/atom.xml" rel="alternate" title="Everything Counts" type="application/atom+xml">
	<link rel="canonical" href="">
	<link href="/favicon.png" rel="shortcut icon">
	<link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
	<!--[if lt IE 9]><![endif]-->
	<!--- MathJax Configuration -->

</head>

<body>
	<header id="header" class="inner"><h1><a href="/">Everything Counts</a></h1>
<nav id="main-nav"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</nav>
<nav id="mobile-nav">
	<div class="alignleft menu">
		<a class="button">Menu</a>
		<div class="container"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</div>
	</div>
	<div class="alignright search">
		<a class="button"></a>
		<div class="container">
			<form action="http://google.com/search" method="get">
				<input type="text" name="q" results="0">
				<input type="hidden" name="q" value="site:ronert-obst.com">
			</form>
		</div>
	</div>
</nav>
<nav id="sub-nav" class="alignright">
	<div class="social">
		
		
		<a class="google" href="https://plus.google.com/102717496982395822694?rel=author" title="Google+">Google+</a>
		
		
		<a class="twitter" href="http://twitter.com/ronert_obst" title="Twitter">Twitter</a>
		
		
		<a class="github" href="https://github.com/ronert" title="GitHub">GitHub</a>
		
    
		
		
		
		
		
		<a class="rss" href="/atom.xml" title="RSS">RSS</a>
		
	</div>
	<form class="search" action="http://google.com/search" method="get">
		<input class="alignright" type="text" name="q" results="0">
		<input type="hidden" name="q" value="site:ronert-obst.com">
	</form>
</nav>

</header>
	
		
	
	<div id="content" class="inner"><article class="post">
	<h2 class="title">Linkfest</h2>
	<div class="entry-content"><p>
I am going to try and start posting regularily again, including proper
blog posts and not just linkfests.
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Statistics and Machine Learning</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://ivory.idyll.org/blog/not-sucking.html][Writing%20Code%20That%20Doesn't%20Suck]]">A Fervent Defense of Frequentist Statistics</a>
</li>
<li><a href="http://deeplearning4j.org/">Neural nets overview</a>
</li>
<li><a href="http://jmapping-maplabs.rhcloud.com/getting-started-with-scripted-geo-data-processing-postgresql-postgis-python-and-a-little-ogr/?utm_content%253Dbuffer1bae0&utm_medium%253Dsocial&utm_source%253Dtwitter.com&utm_campaign%253Dbuffer][Getting%20Started%20With%20Scripted%20Geo-Data%20Processing%20(PostgreSQL,%20PostGIS,%20Python,%20and%20a%20little%20OGR)%20|%20Geo%20Perspectives]]">Bayesian Statistical Analysis with PyMC</a>
</li>
<li><a href="http://www.cedar.buffalo.edu/~srihari/CSE574/">Machine Learning and Probabilistic Graphical Models: Course Materials</a>
</li>
<li><a href="http://continuum.io/blog/bokeh-0.4.1%255D%255BBokeh%25200.4.1%255D%255D][Building%20Responsive%20Visualizations%20with%20D3.js%20|%20Safari%20Books%20Online's%20Official%20Blog]]">A visual explanation of conditional probability</a>
</li>
<li><i>Data Analysis: The Hard Parts</i>
</li>
<li><a href="http://blog.udacity.com/2014/02/now-available-at-udacity-courses-from.html">New machine learning MOOcs at Udacity from Georgia Tech</a>
</li>
<li><a href="http://nbviewer.ipython.org/github/mwaskom/seaborn/blob/master/examples/plotting_distributions.ipynb?utm_content=buffer2788d&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer">Visualizing distributions of data</a>
</li>
<li><a href="http://www.kdnuggets.com/2014/02/exclusive-yann-lecun-deep-learning-facebook-ai-lab.html">Interview with Yann LeCun, Deep Learning Expert, Director of Facebook AI Lab</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">ML/Stats Package of the Week</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://continuum.io/blog/bokeh-0.4.1">Bokeh 0.4.1</a>
</li>
<li><a href="http://arxiv.org/abs/1312.2171">bartMachine: Machine Learning with Bayesian Additive Regression Trees</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Paper(s) of the Week</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="http://arxiv.org/abs/1312.6116">Improving Deep Neural Networks with Probabilistic Maxout Units</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Programming</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="http://deeplearning4j.org/][deeplearning4j.org]]">Python Tools for Machine Learning</a> (really nice and worthwhile overview)
</li>
<li><a href="http://deeplearning4j.org/%255D%255Bdeeplearning4j.org%255D%255D][Python%20Tools%20for%20Machine%20Learning%20|%20CB%20Insights'%20Team%20Blog]]">Obtaining, Scrubbing, and Exploring Data at the Command Line</a>
</li>
<li><a href="http://jmapping-maplabs.rhcloud.com/getting-started-with-scripted-geo-data-processing-postgresql-postgis-python-and-a-little-ogr/?utm_content=buffer1bae0&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer">Getting Started With Scripted Geo-Data Processing (PostgreSQL, PostGIS, Python, and a little OGR) | Geo Perspectives</a>
</li>
<li><a href="http://jmapping-maplabs.rhcloud.com/getting-started-with-scripted-geo-data-processing-postgresql-postgis-python-and-a-little-ogr/?utm_content%25253Dbuffer1bae0&utm_medium%25253Dsocial&utm_source%25253Dtwitter.com&utm_campaign%25253Dbuffer%255D%255BGetting%2520Started%2520With%2520Scripted%2520Geo-Data%2520Processing%2520(PostgreSQL,%2520PostGIS,%2520Python,%2520and%2520a%2520little%2520OGR)%2520|%2520Geo%2520Perspectives%255D%255D][PyTenn_PyMC.pdf%20%E2%80%A2%20Droplr]]">High Performance Python at PyDataLondon 2014</a>
</li>
<li><a href="http://lintool.github.io/MapReduceAlgorithms/MapReduce-book-final.pdf">Data-Intensive Text Processing with MapReduce</a>
</li>
<li><a href="http://tapoueh.org/blog/2014/02/21-PostgreSQL-histogram.html">Drawing histograms in PostgreSQL</a>
</li>
<li><a href="http://continuum.io/blog/bokeh-0.4.1][Bokeh%200.4.1]]">Building Responsive Visualizations with D3.js</a>
</li>
<li><a href="https://github.com/yhat/pandasql">pandasql</a> (pandas with SQL syntax)
</li>
<li><a href="http://ivory.idyll.org/blog/not-sucking.html">Writing Code That Doesn&#8217;t Suck</a>
</li>
<li><a href="https://github.com/jimbojsb/launchrocket">launchrocket</a> (a Mac PrefPane to manage all your Homebrew-installed services)
</li>
<li><a href="http://www.xavierdupre.fr/blog/2013-11-30_nojs.html?utm_content=buffer3b362&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer">More about interactive graphs using Python, d3.js, R, shiny, IPython, vincent, d3py, python-nvd3</a>
</li>
<li><a href="http://pypix.com/roundups/best-python-2013/">The Best of Python in 2013</a>
</li>
<li><a href="http://pypix.com/roundups/best-python-2013/%255D%255BThe%2520Best%2520of%2520Python%2520in%25202013%2520|%2520Pypix%255D%255D][The%20Yaksis]]">Vowpal Wabbit: the redis of the data science community</a>
</li>
<li><a href="http://darrenjw.wordpress.com/2014/02/23/parallel-monte-carlo-using-scala/">Parallel Monte Carlo using Scala</a>
</li>
<li><a href="http://stevenloria.com/python-best-practice-patterns-by-vladimir-keleshev-notes/">Steven Loria | Python Best Practice Patterns</a>
</li>
<li><a href="http://blog.safaribooksonline.com/2014/02/27/using-ipython-profiles/?cid=201402-blog-ipython-social">Using IPython Profiles for More Effective Interactive Sessions</a>
</li>
<li><a href="http://nbviewer.ipython.org/github/mwaskom/seaborn/blob/master/examples/plotting_distributions.ipynb?utm_content%253Dbuffer2788d&utm_medium%253Dsocial&utm_source%253Dtwitter.com&utm_campaign%253Dbuffer][Visualizing%20distributions%20of%20data]]">Introducing the Pig Cheat Sheet</a>
</li>
<li><a href="http://lcolladotor.github.io/2014/02/26/excited-by-willingness-to-help-get-things-done/?utm_source=feedburner&utm_medium=twitter&utm_campaign=Feed:+FellgernonBit-rstats+(Fellgernon+Bit+-+rstats)#.UxYkc-ddUwN">rMaps Mexico map</a>
</li>
<li><a href="http://acm3.wustl.edu/functional/haskell.php?utm_content=buffer40486&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer">How to learn Haskell</a>
</li>
<li><a href="http://twiecki.github.io/blog/2014/02/24/ipython-nb-cluster/">Easily distributing a parallel IPython Notebook on a cluster</a>
</li>
<li><a href="https://www.fpcomplete.com/user/haroldcarr/example-of-why-to-use-monads-what-they-can-do">Example of why to use monads - what they can do</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Other cool stuff</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="http://ift.tt/1ha1pwM">EDEKA Supergeil (feat. Friedrich Liechtenstein)</a>
</li>
</ul>
</div>
</div>
</div>


<div class="meta">
	<div class="date">








  


<time datetime="2014-03-04T00:00:00+01:00" pubdate data-updated="true">Mar 4<span>th</span>, 2014</time></div>
	<div class="tags">


	<a class='category' href='/blog/categories/linkfest/'>Linkfest</a>


</div>
	
</div></article>

	<div class="share">
	<div class="addthis_toolbox addthis_default_style ">
	
	
	<a class="addthis_button_tweet"></a>
	
	
	<a class="addthis_button_google_plusone" g:plusone:size="medium"></a>
	
	<a class="addthis_counter addthis_pill_style"></a>
	</div>
  <script type="text/javascript" src="http://s7.addthis.com/js/250/addthis_widget.js#pubid="></script>
</div>


</div>
	<footer id="footer" class="inner">Copyright &copy; 2014

    Ronert Obst

– Proud member of <a href="http://www.r-bloggers.com">www.r-bloggers.com</a>
</footer>
	<script src="/javascripts/slash.js"></script>
<script src="/javascripts/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
	$('.fancybox').fancybox();
})(jQuery);
</script> <!-- Delete or comment this line to disable Fancybox -->


<script type="text/javascript">
      var disqus_shortname = 'everythingcounts';
      
        
        var disqus_script = 'count.js';
      
    (function () {
      var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
      dsq.src = 'http://' + disqus_shortname + '.disqus.com/' + disqus_script;
      (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>



	<script type="text/javascript">
		var _gaq = _gaq || [];
		_gaq.push(['_setAccount', 'UA-40781735-1']);
		_gaq.push(['_trackPageview']);

		(function() {
			var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
			ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
			var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
		})();
	</script>



</body>
</html>